#+TAGS: { FAILS(f) PARTLY(p) WORKS(w) example(e)}
#+EXPORT_EXCLUDE_TAGS: noexport

*Note:* a complete list of these features including keyboard
  shortcuts, links, and descriptions is available on
  https://github.com/novoid/github-orgmode-tests

This page demonstrates Org-mode features that are (or are not)
supported by github which is using an (old) version of [[https://github.com/wallyqs/org-ruby][org-ruby]].

Last GitHub feature render check and last table update: <2020-10-15 Thu> 

# FIXXME 2020-10-15: Following line causes my Org to display column view mode instead of re-generating the filtered table:
# :exclude-tags "example" 

#+BEGIN: columnview :id "Featuretest" :match "WORKS|FAILS|PARTLY" :format "%ITEM(Feature) %TAGS(status)"
| Feature                                                                           | status           |
|-----------------------------------------------------------------------------------+------------------|
| Text formatting                                                                   | :WORKS:          |
| Text formatting within other syntax elements                                      | :WORKS:          |
| Lists                                                                             | :PARTLY:         |
| Headings with TODO items                                                          | :FAILS:          |
| Drawers                                                                           | :FAILS:          |
| blocks ([[http://orgmode.org/org.html#Blocks][docu]])                                                                     | :PARTLY:         |
| EXAMPLE block                                                                     | :WORKS:          |
| QUOTE block                                                                       | :WORKS:          |
| VERSE block                                                                       | :FAILS:          |
** tables complex ([[http://orgmode.org/org.html#The-Spreadsheet][docu]], [[http://orgmode.org/worg/org-tutorials/org-spreadsheet-intro.html][tutorial]])                                  :PARTLY:

- MISSING:
  - Tables are concatenated unfortunately and alignment fails.

#+TBLNAME: mydemo-USD-EUR-rate
| *US-Dollar* |      *EUR* |
|           1 | 0.76481836 |

|     *When* | *What*                 | *USD* | *EUR* |
|------------+------------------------+-------+-------|
| 2012-02-03 | Taxi Graz-Airport      |       | 18.00 |
| 2012-02-03 | Taxi Seattle Airport   | 25.00 | 19.12 |
| 2012-02-13 | Taxi                   |  7.00 |  5.35 |
| 2012-02-14 | Taxi                   |  8.00 |  6.12 |
| 2012-02-17 | Taxi to Airport SeaTac | 35.00 | 26.77 |
| 2012-02-22 | Taxi Airport-Graz      |       | 16.00 |
|------------+------------------------+-------+-------|
|            |                        |       | 91.36 |
#+TBLFM: @>$4=vsum(@I$4..@II$4);%.2f::@3$4=@3$3*remote(mydemo-USD-EUR-rate,@2$2);%.2f::@4$4=@4$3*remote(mydemo-USD-EUR-rate,@2$2);%.2f::@5$4=@5$3*remote(mydemo-USD-EUR-rate,@2$2);%.2f::@6$4=@6$3*remote(mydemo-USD-EUR-rate,@2$2);%.2f

**** example item
:LOGBOOK:
CLOCK: [2012-11-19 Mon 11:16]--[2012-11-19 Mon 11:17] =>  0:01
CLOCK: [2012-11-18 Sun 19:15]--[2012-11-18 Sun 19:23] =>  0:08
:END:

**** another item
:LOGBOOK:
CLOCK: [2012-11-18 Sun 19:26]--[2012-11-18 Sun 19:33] =>  0:07
CLOCK: [2012-11-17 Sat 16:25]--[2012-11-18 Sun 19:25] => 27:00
:END:


** tables

| *head1*               | *head2* | *head3* |
|-----------------------+---------+---------|
| text                  |      42 | -----   |
| me@server.example.com |      23 | :-)     |
|-----------------------+---------+---------|
|                       |      65 |         |
#+TBLFM: @>$2 = vsum(@I$2..@II$2)

